rocksdb/experiments/M1/results/20260428-125216/db_bench.log
RocksDB:    version 8.11.3
Date:       Tue Apr 28 12:52:16 2026
CPU:        16 * Intel(R) Xeon(R) Gold 5320 CPU @ 2.20GHz
CPUCache:   16384 KB
Set seed to 1777380736879949 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    1000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    991.8 MB (estimated)
FileSize:   503.5 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [rocksdbtest/dbbench]
fillrandom   :       6.210 micros/op 161040 ops/sec 6.210 seconds 1000000 operations;  159.7 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :       5.746 micros/op 174021 ops/sec 5.746 seconds 1000000 operations;  172.6 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :       4.583 micros/op 218172 ops/sec 4.584 seconds 1000000 operations;  216.4 MB/s
DB path: [rocksdbtest/dbbench]
compact      : 12520792.000 micros/op 0 ops/sec 12.521 seconds 1 operations;


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      0/0    0.00 KB   0.0      0.0     0.0      0.0       2.9      2.9       0.0   1.0      0.0    462.6      6.33              4.43        49    0.129       0      0       0.0       0.0
  L1      0/0    0.00 KB   0.0      5.1     2.9      2.3       3.8      1.6       0.0   1.3    267.2    199.2     19.67             16.23         8    2.459   5223K  1329K       0.0       0.0
  L2     17/0   955.76 MB   0.4      2.2     1.1      1.1       1.6      0.5       0.4   1.4    331.1    238.8      6.87              5.92        11    0.624   2260K   630K       0.0       0.0
 Sum     17/0   955.76 MB   0.0      7.4     4.0      3.4       8.3      4.9       0.4   2.9    229.1    258.2     32.87             26.58        68    0.483   7483K  1959K       0.0       0.0
 Int      0/0    0.00 KB   0.0      7.1     3.7      3.4       7.7      4.3       0.4   3.1    233.5    251.2     31.20             25.32        60    0.520   7242K  1938K       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0      7.4     4.0      3.4       5.4      2.1       0.0   0.0    283.7    209.5     26.54             22.15        19    1.397   7483K  1959K       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0       2.9      2.9       0.0   0.0      0.0    462.6      6.33              4.43        49    0.129       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 29.1 total, 26.1 interval
Flush(GB): cumulative 2.858, interval 2.443
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 8.29 GB write, 291.91 MB/s write, 7.35 GB read, 259.03 MB/s read, 32.9 seconds
Interval compaction: 7.65 GB write, 300.78 MB/s write, 7.12 GB read, 279.61 MB/s read, 31.2 seconds
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 0, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 0, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 0, total-stops: 0
Block cache LRUCache@0x5565ec3a2df0#41399 capacity: 32.00 MB seed: 863227213 usage: 0.09 KB table_size: 1024 occupancy: 1 collections: 1 last_copies: 1 last_secs: 0.000182 secs_since: 29
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 29.1 total, 26.1 interval
Cumulative writes: 3000K writes, 3000K keys, 3000K commit groups, 1.0 writes per commit group, ingest: 2.95 GB, 103.93 MB/s
Cumulative WAL: 3000K writes, 0 syncs, 3000000.00 writes per sync, written: 2.95 GB, 103.93 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 2519K writes, 2519K keys, 2519K commit groups, 1.0 writes per commit group, ingest: 2537.61 MB, 97.37 MB/s
Interval WAL: 2519K writes, 0 syncs, 2519771.00 writes per sync, written: 2.48 GB, 97.37 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent
Write Stall (count): write-buffer-manager-limit-stops: 0